tap "fujiwara/tap"
tap "hikoyu/shogi"
tap "romkatv/powerlevel10k"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Parser generator
brew "bison"
# Freely available high-quality data compressor
brew "bzip2"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Color-highlighted diff(1) output
brew "colordiff"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Text processing system for reStructuredText
brew "docutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU multiple precision arithmetic library
brew "gmp"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Audio codec
brew "opus"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Process Management Interface for HPC environments
brew "pmix"
# High performance message passing library
brew "open-mpi"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library access to GnuPG
brew "gpgme"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Input filter for the pager less
brew "lesspipe"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library to render SVG files using Cairo
brew "librsvg"
# XML security library
brew "libxmlsec1"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful multi-lingual file viewer/grep
brew "lv"
# Utility for directing compilation
brew "make"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple NodeJS versions
brew "nodenv"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Cross-platform, high performance scoring engine for ML models
brew "onnxruntime"
# Development kit for the Java programming language
brew "openjdk"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk@11"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# Shell command parallelization utility
brew "parallel"
# Simplistic interactive filtering tool
brew "peco"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# SOcket CAT: netcat on steroids
brew "socat"
# SSL tunneling program
brew "stunnel", restart_service: :changed
# Tool Command Language
brew "tcl-tk"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image processing library
brew "vips"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# ECS task event/log tracer CLI
brew "fujiwara/tap/tracer"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Menu bar icon organiser
cask "bartender"
# Clipboard extension app
cask "clipy"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Screen colour temperature controller
cask "flux"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# Web browser
cask "google-chrome"
# Japanese input software
cask "google-japanese-ime"
# Terminal built on web technologies
cask "hyper"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# IDE for professional Python development
cask "pycharm"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "abusaidm.html-snippets"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadawais.shades-of-purple"
vscode "aki77.rails-db-schema"
vscode "aki77.rails-routes"
vscode "albert.tabout"
vscode "alexisvt.flutter-snippets"
vscode "angelomollame.conflict-squeezer"
vscode "arjun.swagger-viewer"
vscode "asdine.cue"
vscode "babakks.vscode-go-test-suite"
vscode "batisteo.vscode-django"
vscode "benjaminadk.emojis4git"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "boto3typed.boto3-ide"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "cameron.vscode-pytest"
vscode "castwide.solargraph"
vscode "christian-kohler.path-intellisense"
vscode "circlecodesolution.ccs-flutter-color"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "crystal-spider.jsdoc-generator"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "davidpallinder.rails-test-runner"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dongli.python-preview"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "evilz.vscode-reveal"
vscode "exiasr.hadolint"
vscode "felixangelov.bloc"
vscode "fnando.ruby"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "frullah.ruby-yard-snippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "groksrc.ruby"
vscode "gruntfuggly.todo-tree"
vscode "harg.iceberg"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hjleochen.rails-nav"
vscode "hoovercj.ruby-linter"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "jcbuisson.vue"
vscode "jduponchelle.rainbow-end"
vscode "jeroen-meijer.pubspec-assist"
vscode "jnbt.vscode-rufo"
vscode "joaompinto.vscode-graphviz"
vscode "kaiwood.endwise"
vscode "karunamurti.rspec-snippets"
vscode "kevinrose.vsc-python-indent"
vscode "kirozen.wordcounter"
vscode "koichisasada.vscode-rdbg"
vscode "kyleetehkitty.starboundjson"
vscode "ldrner.rspec-snippets-vscode"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "marcelovelasquez.flutter-tree"
vscode "mechatroner.rainbow-csv"
vscode "mermade.openapi-lint"
vscode "mhutchie.git-graph"
vscode "miguel-savignano.ruby-symbols"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native-preview"
vscode "msyrus.go-doc"
vscode "nash.awesome-flutter-snippets"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "nmrmsys.vscode-sql-formatter-mod"
vscode "noku.rails-run-spec-vscode"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "patbenatar.advanced-new-file"
vscode "pavlitsky.yard"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "premparihar.gotestexplorer"
vscode "proohit.openapi-snippets"
vscode "rclt2m.go-outliner-simplify"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "romanpeshkov.go-test-outline"
vscode "sdras.night-owl"
vscode "shamanu4.django-intellisense"
vscode "shan.code-settings-sync"
vscode "shanehofstetter.rails-i18n"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shiesh.todo-tree"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sirtobi.code-clip-ring"
vscode "soerenuhrbach.vscode-deepl"
vscode "sporto.rails-go-to-spec"
vscode "steoates.autoimport"
vscode "stoplight.spectral"
vscode "streetsidesoftware.code-spell-checker"
vscode "svipas.prettier-plus"
vscode "tabnine.tabnine-vscode"
vscode "thadeu.vscode-run-rspec-file"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vayan.haml"
vscode "vense.rails-snippets"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vortizhe.simple-ruby-erb"
vscode "vtrois.gitmoji-vscode"
vscode "vue.volar"
vscode "walkme.ruby-extension-pack"
vscode "wayou.vscode-todo-highlight"
vscode "windmilleng.vscode-go-autotest"
vscode "yoavbls.pretty-ts-errors"
vscode "zainchen.json"
vscode "zedobaia.django-pyqt"
